* 2017
** 2017-07 July
*** 2017-07-21 Friday
**** CAT put
     |----+------+-------+------------------|
     | -1 |   95 | put   | <2017-07-21 Fri> |
     | -1 |  102 | put   | <2017-07-21 Fri> |
     |----+------+-------+------------------|
     |    | 0.49 | trade | <2017-06-06 Tue> |
     |    | 0.50 | trade | <2017-07-06 Thu> |
     |----+------+-------+------------------|
     |    | 0.99 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** COST put
     |----+------+-------+------------------|
     | -2 |  150 | put   | <2017-07-21 Fri> |
     |----+------+-------+------------------|
     |    | 2.17 | trade | <2017-06-23 Fri> |
     |----+------+-------+------------------|
     |    | 2.17 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** HD put
     |----+------+-------------+------------------|
     | -1 |  143 | put         | <2017-07-21 Fri> |
     | -1 |  145 | put         | <2017-07-21 Fri> |
     | -1 |  146 | put         | <2017-07-21 Fri> |
     |----+------+-------------+------------------|
     |    | 0.46 | jul 143-put | <2017-07-20 Thu> |
     |    | 0.56 | jul 145-put | <2017-06-23 Fri> |
     |    | 0.42 | jul 146-put | <2017-07-05 Wed> |
     |----+------+-------------+------------------|
     |    | 1.44 |             |                  |
     |----+------+-------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** NVDA strangle
     |----+------+-------+------------------|
     | -1 |  150 | put   | <2017-07-21 Fri> |
     | -1 |  175 | call  | <2017-07-21 Fri> |
     |----+------+-------+------------------|
     |    | 1.48 | trade | <2017-07-12 Wed> |
     |----+------+-------+------------------|
     |    | 1.48 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** TSLA put
     |----+------+-------+------------------|
     | -1 |  270 | put   | <2017-07-21 Fri> |
     |----+------+-------+------------------|
     |    | 1.10 | trade | <2017-07-07 Fri> |
     |----+------+-------+------------------|
     |    | 1.10 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** WMT put
     |----+------+-------+------------------|
     | -2 | 72.5 | put   | <2017-07-21 Fri> |
     |----+------+-------+------------------|
     |    | 0.32 | trade | <2017-07-07 Fri> |
     |----+------+-------+------------------|
     |    | 0.32 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
** 2017-08 August
*** 2017-08-18 Friday
**** COST put
     |----+------+------------------------+------------------|
     | -1 |  150 | put                    | <2017-08-18 Fri> |
     |----+------+------------------------+------------------|
     |    | 1.43 | trade                  | <2017-06-22 Thu> |
     |    | 0.70 | roll jul->aug 153->150 | <2017-07-12 Wed> |
     |----+------+------------------------+------------------|
     |    | 2.13 |                        |                  |
     |----+------+------------------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** COST put
     |----+------+-------+------------------|
     | -1 |  140 | put   | <2017-08-18 Fri> |
     | -1 |  145 | put   | <2017-08-18 Fri> |
     | -1 |  150 | put   | <2017-08-18 Fri> |
     |----+------+-------+------------------|
     |    | 0.66 | trade | <2017-07-07 Fri> |
     |    | 0.78 | trade | <2017-07-05 Wed> |
     |    | 1.52 | trade | <2017-07-05 Wed> |
     |----+------+-------+------------------|
     |    | 2.96 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** ED call
     |----+------+----------+------------------|
     | -1 |   80 | call     | <2017-08-18 Fri> |
     |----+------+----------+------------------|
     |    | 0.58 | trade    | <2017-05-10 Wed> |
     |    | 0.34 | 75 put   | <2017-05-10 Wed> |
     |    | 0.50 | jun->jul | <2017-06-06 Tue> |
     |    | 0.61 | jul->aug | <2017-07-03 Mon> |
     |----+------+----------+------------------|
     |    | 2.03 |          |                  |
     |----+------+----------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** ED put
     |----+------+-------+------------------|
     | -1 |   80 | put   | <2017-08-18 Fri> |
     |----+------+-------+------------------|
     |    | 0.85 | trade | <2017-06-27 Tue> |
     |----+------+-------+------------------|
     |    | 0.85 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** FXE strangle
     |----+------+-------+------------------|
     | -1 |  108 | put   | <2017-08-18 Fri> |
     | -1 |  113 | call  | <2017-08-18 Fri> |
     |----+------+-------+------------------|
     |    | 0.38 | trade | <2017-07-13 Thu> |
     |----+------+-------+------------------|
     |    | 0.38 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** HD call
     |----+------+-------------------+------------------|
     | -1 |  150 | call              | <2017-08-18 Fri> |
     |----+------+-------------------+------------------|
     |    | 0.88 | trade             | <2017-04-03 Mon> |
     |    | 1.45 | 148->150 apr->may | <2017-04-11 Tue> |
     |    | 1.30 | may->jul          | <2017-05-01 Mon> |
     |    | 1.28 | jul->aug          | <2017-05-26 Fri> |
     |----+------+-------------------+------------------|
     |    | 4.91 |                   |                  |
     |----+------+-------------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** HD put
     |----+------+-------+------------------|
     | -1 |  140 | put   | <2017-08-18 Fri> |
     | -1 |  145 | put   | <2017-08-18 Fri> |
     |----+------+-------+------------------|
     |    | 0.85 | trade | <2017-07-05 Wed> |
     |    | 0.98 | trade | <2017-07-18 Tue> |
     |----+------+-------+------------------|
     |    | 1.83 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** HES put
     |----+------+----------+------------------|
     | -1 |   45 | put      | <2017-08-18 Fri> |
     |----+------+----------+------------------|
     |    | 0.68 | trade    | <2017-05-23 Tue> |
     |    | 0.99 | jun->jul | <2017-06-16 Fri> |
     |    | 0.90 | jul->aug | <2017-07-13 Thu> |
     |----+------+----------+------------------|
     |    | 2.57 |          |                  |
     |----+------+----------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** HTZ call
     |----+------+-------+------------------|
     | -1 | 17.5 | call  | <2017-08-18 Fri> |
     |----+------+-------+------------------|
     |    | 0.75 | trade | <2017-07-13 Thu> |
     |----+------+-------+------------------|
     |    | 0.75 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** HTZ call spread
     |----+------+-------+------------------|
     | -1 | 12.5 | call  | <2017-08-18 Fri> |
     |  1 |   15 | call  | <2017-08-18 Fri> |
     |----+------+-------+------------------|
     |    | 0.53 | trade | <2017-06-28 Wed> |
     |----+------+-------+------------------|
     |    | 0.53 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** ICE call
     |----+------+---------------+------------------|
     | -1 |   65 | call          | <2017-08-18 Fri> |
     |----+------+---------------+------------------|
     |    | 0.45 | trade         | <2017-06-07 Wed> |
     |    | 0.92 | roll jul->aug | <2017-07-14 Fri> |
     |----+------+---------------+------------------|
     |    | 1.37 |               |                  |
     |----+------+---------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** KRE put spread
     |----+------+-------+------------------|
     |  1 |   45 | put   | <2017-08-18 Fri> |
     | -1 |   50 | put   | <2017-08-18 Fri> |
     |----+------+-------+------------------|
     |    | 0.20 | trade | <2017-07-11 Tue> |
     |----+------+-------+------------------|
     |    | 0.20 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** MCD put
     |----+------+-------------+------------------|
     | -1 |  145 | put         | <2017-08-18 Fri> |
     |----+------+-------------+------------------|
     |    | 1.00 | aug 145-put | <2017-06-29 Thu> |
     |----+------+-------------+------------------|
     |    | 1.00 |             |                  |
     |----+------+-------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** NAT put
     |----+------+----------+------------------|
     | -2 |    7 | put      | <2017-08-18 Fri> |
     |----+------+----------+------------------|
     |    | 0.80 | trade    | <2017-05-16 Tue> |
     |    | 0.20 | jun->jul | <2017-06-12 Mon> |
     |    | 0.60 | jul->aug | <2017-07-06 Thu> |
     |----+------+----------+------------------|
     |    | 1.60 |          |                  |
     |----+------+----------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** OIH ratio put spread
     |----+------+----------+------------------|
     | -2 |   27 | put      | <2017-08-18 Fri> |
     | -1 |   28 | put      | <2017-08-18 Fri> |
     |----+------+----------+------------------|
     |    | 0.19 | trade    | <2017-04-28 Fri> |
     |    | 0.35 | jun->jul | <2017-06-17 Sat> |
     |    | 0.26 | jul->aug | <2017-07-19 Wed> |
     |----+------+----------+------------------|
     |    | 0.80 |          |                  |
     |----+------+----------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** QQQ call
     |----+------+-------------------+-------------------|
     | -1 |  136 | call              | <2017-08-18 Fri>  |
     |----+------+-------------------+-------------------|
     |    | 1.23 | trade             | <2017-04-20 Thu>  |
     |    | 0.79 | may->jun          | <2017-05-03 Wed>  |
     |    | 0.16 | jun->aug 134->136 | <2017-05-17 Wed > |
     |----+------+-------------------+-------------------|
     |    | 2.18 |                   |                   |
     |----+------+-------------------+-------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** QQQ call
     |----+------+-------------------+------------------|
     | -1 |  137 | call              | <2017-08-18 Fri> |
     |----+------+-------------------+------------------|
     |    | 1.50 | trade             | <2017-04-20 Thu> |
     |    | 0.35 | jun->aug 135->137 | <2017-05-17 Wed> |
     |----+------+-------------------+------------------|
     |    | 1.85 |                   |                  |
     |----+------+-------------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** QQQ put
     |----+------+-------------+------------------|
     | -1 |  128 | put         | <2017-08-18 Fri> |
     | -1 |  129 | put         | <2017-08-18 Fri> |
     | -1 |  130 | put         | <2017-08-18 Fri> |
     |----+------+-------------+------------------|
     |    | 0.72 | jul 130-put | <2017-06-29 Thu> |
     |    | 0.56 | jul 131-put | <2017-06-27 Tue> |
     |    | 1.05 | aug 128-put | <2017-07-03 Mon> |
     |    | 0.85 | aug 129-put | <2017-06-27 Tue> |
     |    | 0.85 | aug 130-put | <2017-06-27 Tue> |
     |----+------+-------------+------------------|
     |    | 4.03 |             |                  |
     |----+------+-------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** SLB put
     |----+------+----------+------------------|
     | -1 |   70 | put      | <2017-08-18 Fri> |
     |----+------+----------+------------------|
     |    | 0.89 | trade    | <2017-04-24 Mon> |
     |    | 1.11 | jun->jul | <2017-06-09 Fri> |
     |    | 0.35 | jul->aug | <2017-07-06 Thu> |
     |----+------+----------+------------------|
     |    | 2.35 |          |                  |
     |----+------+----------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** SLB put
     |----+------+----------+------------------|
     | -1 | 72.5 | put      | <2017-08-18 Fri> |
     |----+------+----------+------------------|
     |    | 1.51 | trade    | <2017-04-24 Mon> |
     |    | 0.66 | jun->jul | <2017-06-09 Fri> |
     |    | 0.20 | jul->aug | <2017-07-03 Mon> |
     |----+------+----------+------------------|
     |    | 2.37 |          |                  |
     |----+------+----------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** TLT strangle
     |----+------+-------+------------------|
     | -1 |  118 | put   | <2017-08-18 Fri> |
     | -1 |  128 | call  | <2017-08-18 Fri> |
     |----+------+-------+------------------|
     |    | 0.59 | trade | <2017-07-11 Tue> |
     |----+------+-------+------------------|
     |    | 0.59 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** XRT jade lizard
     |----+------+-------+------------------|
     | -1 |   38 | put   | <2017-08-18 Fri> |
     | -1 |   40 | call  | <2017-08-18 Fri> |
     |  1 |   41 | call  | <2017-08-18 Fri> |
     |----+------+-------+------------------|
     |    | 1.00 | trade | <2017-06-23 Fri> |
     |----+------+-------+------------------|
     |    | 1.00 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
** 2017-09 September
*** 2017-09-15 Friday
**** AMRN reverse big lizard
     |----+------+-------+------------------|
     |  1 |  2.5 | put   | <2017-09-15 Fri> |
     | -1 |    3 | put   | <2017-09-15 Fri> |
     | -1 |    3 | call  | <2017-09-15 Fri> |
     |----+------+-------+------------------|
     |    | 0.82 | trade | <2017-05-10 Wed> |
     |----+------+-------+------------------|
     |    | 0.82 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** MCD big lizard
     |----+-------+----------------------+------------------|
     | -1 |   145 | put                  | <2017-07-21 Fri> |
     | -1 |   145 | put                  | <2017-09-15 Fri> |
     | -1 |   145 | call                 | <2017-09-15 Fri> |
     |  1 |   150 | call                 | <2017-09-15 Fri> |
     |----+-------+----------------------+------------------|
     |    |  5.02 | trade                | <2017-05-17 Wed> |
     |    | -0.24 | call spread jul->sep | <2017-05-31 Wed> |
     |    |  2.07 | sep 145-put          | <2017-06-29 Thu> |
     |----+-------+----------------------+------------------|
     |    |  6.85 |                      |                  |
     |----+-------+----------------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** WMT call
     |----+------+----------+------------------|
     | -2 | 72.5 | call     | <2017-09-15 Fri> |
     |----+------+----------+------------------|
     |    | 0.04 | trade    | <2017-03-27 Mon> |
     |    | 0.80 | apr->may | <2017-04-12 Wed> |
     |    | 0.59 | may->jun | <2017-04-24 Mon> |
     |    | 1.58 | jun->sep | <2017-05-10 Wed> |
     |----+------+----------+------------------|
     |    | 3.01 |          |                  |
     |----+------+----------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** WMT big lizard
     |----+------+-------+------------------|
     | -1 | 77.5 | put   | <2017-09-15 Fri> |
     | -1 | 77.5 | call  | <2017-09-15 Fri> |
     |  1 |   80 | call  | <2017-09-15 Fri> |
     |----+------+-------+------------------|
     |    | 4.24 | trade | <2017-05-10 Wed> |
     |    | 4.11 | trade | <2017-06-27 Tue> |
     |----+------+-------+------------------|
     |    | 8.35 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
** 2017-10 October
*** 2017-10-20 Friday
**** HTZ put
     |----+------+----------+------------------|
     | -1 |   45 | put      | <2017-10-20 Fri> |
     |----+------+----------+------------------|
     |    | 0.51 | trade    | <2017-03-13 Mon> |
     |    | 0.16 | apr->may | <2017-04-10 Mon> |
     |    | 0.45 | may->jul | <2017-04-24 Mon> |
     |    | 0.15 | jul->oct | <2017-07-07 Fri> |
     |----+------+----------+------------------|
     |    | 1.27 |          |                  |
     |----+------+----------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
** 2017-11 November
*** 2017-11-17 Friday
**** CAT call
     |----+------+----------+------------------|
     | -2 |  100 | call     | <2017-11-17 Fri> |
     |----+------+----------+------------------|
     |    | 2.28 | trade    | <2017-04-24 Mon> |
     |    | 1.02 | apr->jul | <2017-04-26 Wed> |
     |    | 0.68 | 92.5 put | <2017-05-05 Fri> |
     |    | 0.49 | 95 put   | <2017-06-06 Tue> |
     |    | 0.50 | 102 put  | <2017-07-06 Thu> |
     |    | 1.24 | jul->aug | <2017-07-03 Mon> |
     |    | 3.56 | aug->nov | <2017-07-17 Mon> |
     |----+------+----------+------------------|
     |    | 9.77 |          |                  |
     |----+------+----------+------------------|
      #+TBLFM: @>$2=vsum(@II..III);%.2f
** 2017-12 December
*** 2017-12-15 Friday
**** ICE call
     |----+------+-------+------------------|
     | -1 |   70 | call  | <2017-12-15 Fri> |
     |----+------+-------+------------------|
     |    | 0.85 | trade | <2017-06-07 Wed> |
     |----+------+-------+------------------|
     |    | 0.85 |       |                  |
     |----+------+-------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
**** MCD call
     |----+------+-----------------------+------------------|
     | -1 |  135 | call                  | <2017-12-15 Fri> |
     |----+------+-----------------------+------------------|
     |    | 1.55 | trade                 | <2017-04-06 Thu> |
     |    | 1.88 | put 125->141          | <2017-04-28 Fri> |
     |    | 3.16 | may->jun put 141->145 | <2017-05-04 Thu> |
     |    | 1.12 | jun->dec              | <2017-05-31 Wed> |
     |----+------+-----------------------+------------------|
     |    | 7.71 |                       |                  |
     |----+------+-----------------------+------------------|
     #+TBLFM: @>$2=vsum(@II..III);%.2f
